# MepSystemLineGraphicsOverridesParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepSystemLineGraphicsOverridesParam Property
ParameterTypeId Class See Also
---
"Graphic Overrides"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepSystemLineGraphicsOverridesParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepSystemLineGraphicsOverridesParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepSystemLineGraphicsOverridesParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace